SPECIALIZATIONS = [
    {"id": 1, "title": "Спортзал"},
    {"id": 2, "title": "Проектор"},
]


ORGANIZATIONS = [
        'ООО "Гармония"',
        'ООО "Ромашка"',
        'ООО "Василек"',
        'ООО "Дашка"',
        'ООО "Колокольчик"',
        'ООО "Жизнь"',
        'ООО "Мир"',
        'ООО "Максим"',
        'ООО "Роза"',
        'ООО "Солнце"',
    ]


SUBJECTS = [
        {"id": 1,  "title": "Русский язык",                         "Dop": [] },
        {"id": 2,  "title": "Литература",                           "Dop": [] },
        {"id": 3,  "title": "Родной язык",                          "Dop": [] },
        {"id": 4,  "title": "Родная литература",                    "Dop": [] },
        {"id": 5,  "title": "Иностранный язык(английский)",         "Dop": [] },
        {"id": 6,  "title": "Второй иностранный язык (немецкий)",   "Dop": [] },
        {"id": 7,  "title": "Математика",                           "Dop": [] },
        {"id": 8,  "title": "Алгебра",                              "Dop": [] },
        {"id": 9,  "title": "Геометрия",                            "Dop": [] },
        {"id": 10, "title": "Информатика и ИКТ",                    "Dop": ["Проектор",] },
        {"id": 11, "title": "История России. Всеобщая история",     "Dop": [] },
        {"id": 12, "title": "Обществознание",                       "Dop": [] },
        {"id": 13, "title": "География",                            "Dop": [] },
        {"id": 14, "title": "ОДНКНР",                               "Dop": [] },
        {"id": 15, "title": "Физика",                               "Dop": [] },
        {"id": 16, "title": "Химия",                                "Dop": [] },
        {"id": 17, "title": "Биология",                             "Dop": [] },
        {"id": 18, "title": "Музыка",                               "Dop": [] },
        {"id": 19, "title": "Изобразительное искусство",            "Dop": [] },
        {"id": 20, "title": "Технология",                           "Dop": [] },
        {"id": 21, "title": "Основы безопасности жизнедеятельности","Dop": [] },
        {"id": 22, "title": "Физическая культура",                  "Dop": ["Спортзал",] },
        {"id": 23, "title": "Астрономия",                           "Dop": [] },
    ]


ROOMS = [
    {"title": 202, "Counts": 30, "dop": ["Проектор",] },
    {"title": 107, "Counts": 30, "dop": []},
    {"title": 104, "Counts": 30, "dop": []},
    {"title": 103, "Counts": 30, "dop": []},
    {"title": 201, "Counts": 30, "dop": []},
    {"title": 204, "Counts": 30, "dop": []},
    {"title": 206, "Counts": 30, "dop": []},
    {"title": 207, "Counts": 30, "dop": []},
    {"title": 208, "Counts": 30, "dop": []},
    {"title": 209, "Counts": 30, "dop": []},
    {"title": 210, "Counts": 30, "dop": []},
    {"title": 1, "Counts": 300, "dop": ["Спортзал",] },
]


CLASSES = [
    {"id": 1, "title": "5", "size": 20, "digit": 5 },
    {"id": 2, "title": "6", "size": 20, "digit": 6 },
    {"id": 3, "title": "7а", "size": 20, "digit": 7, "char": "а" },
    {"id": 4, "title": "7б", "size": 20, "digit": 7, "char": "б" },
    {"id": 5, "title": "8а", "size": 20, "digit": 8, "char": "а" },
    {"id": 6, "title": "8б", "size": 20, "digit": 8, "char": "б" },
    {"id": 7, "title": "9а", "size": 20, "digit": 9, "char": "а" },
    {"id": 8, "title": "9б", "size": 20, "digit": 9, "char": "б" },
    {"id": 9, "title": "9в", "size": 20, "digit": 9, "char": "в" },
    {"id": 10, "title": "10а", "size": 20, "digit": 10, "char": "а" },
    {"id": 11, "title": "10б", "size": 20, "digit": 10, "char": "б" },
    {"id": 12, "title": "10в", "size": 20, "digit": 10, "char": "в" },
    {"id": 13, "title": "11а", "size": 20, "digit": 11, "char": "а" },
    {"id": 14, "title": "11б", "size": 20, "digit": 11, "char": "б" },
    {"id": 15, "title": "11в", "size": 20, "digit": 11, "char": "в" },
]


"""
! Идея
Убрать 'CLASSES', и создавать их интерактивно.
Как только попадается новый класс:
    Спросить кол-во студентов
    Создать новый класс
"""
TEACHERS = [
    {
        "name": "Алексеева", 
        "available": [ 
                {"Gr": "8а, 8б, 9а, 9б, 9в, 10а, 10б, 11а, 11б, 11в", "Disc": [5,]}, #1
            ]
    },
    {
        "name": "Харисова", 
        "available": [
                {"Gr": "5, 6, 7а, 7б, 8а, 8б", "Disc": [19,20,]},
            ]
    },
    {
        "name": "Игнатюк", 
        "available": [ 
                {"Gr": "5, 7а, 7б, 8а, 8б", "Disc": [5,]},
            ]
    },
    {
        "name": "Исайченко", 
        "available": [ 
                {"Gr": "9а, 9б, 11а, 11б", "Disc": [11,12,]},
            ]
    },
    {
        "name": "Костырева", 
        "available": [ 
                {"Gr": "5", "Disc": [11, 14]},
                {"Gr": "6, 7а, 7б, 8а, 8б", "Disc": [11, 12]},
            ]
    },
    {
        "name": "Мурдид", 
        "available": [ 
                {"Gr": "10а, 10б, 10в", "Disc": [11, 12]},
            ]
    },
    {
        "name": "Лазарева", 
        "available": [ 
                {"Gr": "5, 6, 7а, 7б, 8а, 8б", "Disc": [18,]},
            ]
    },
    {
        "name": "Мингазова", 
        "available": [ 
                {"Gr": "6, 7а, 7б", "Disc": [7, ]},
                {"Gr": "11а, 11б, 11в", "Disc": [10,]},
                {"Gr": "8а, 8б, 9а, 9б", "Disc": [10,]},
            ]
    },
    {
        "name": "Вихарева", 
        "available": [ 
                {"Gr": "8а, 8б, 9а, 9б", "Disc": [7,]},
            ]
    },
    {
        "name": "Сергеева", 
        "available": [ 
                {"Gr": "7а, 7б, 8а, 8б, 9а, 9б, 10а, 10б, 11а, 11б", "Disc": [15,]},
            ]
    },
    {
        "name": "Валилуллина", 
        "available": [ 
                {"Gr": "8а, 8б, 9а, 9б", "Disc": [1,2]},
            ]
    },
    {
        "name": "Аминьева", 
        "available": [ 
                {"Gr": "5, 6, 7а, 7б", "Disc": [1,2]},
                {"Gr": "6", "Disc": [1,2]},
                {"Gr": "7а, 7б", "Disc": [1,2]},
            ]
    },
    {
        "name": "Саддыкова", 
        "available": [ 
                {"Gr": "10а, 10б, 11а, 11б", "Disc": [1,2]},
            ]
    },
    {
        "name": "Гусева В.А.", 
        "available": [ 
                {"Gr": "8а, 8б, 9а, 9б", "Disc": [16,]},
                {"Gr": "10а, 10б, 10в, 11а, 11б", "Disc": [16,]},
                {"Gr": "10а, 10б, 10в, 11а, 11б", "Disc": [17,]},
            ]
    },
    {
        "name": "Шаяхметова", 
        "available": [ 
                {"Gr": "5, 6", "Disc": [16,]},
                {"Gr": "7а, 7б, 8а, 8б, 9а, 9б, 9в", "Disc": [16,]},
            ]
    },
    {
        "name": "Якупова", 
        "available": [ 
                {"Gr": "5, 6, 7а, 7б, 9а, 9б, 9в, 11а, 11б, 11в", "Disc": [13,]},
                {"Gr": "11а, 11б", "Disc": [22,]},
            ]
    },
    {
        "name": "Волонихин", 
        "available": [ 
                {"Gr": "11а, 11б", "Disc": [13,]},
                {"Gr": "8а, 8б", "Disc": [13,]},
            ]
    },
    {
        "name": "Якупова А.М.", 
        "available": [ 
                {"Gr": "8а, 8б, 9а, 9б, 9в, 10а, 10б, 10в, 11а, 11б", "Disc": [21,]},
            ]
    },
    {
        "name": "Жужель О.В.", 
        "available": [ 
                {"Gr": "10а, 10б, 10в, 11а, 11б", "Disc": [7,]},
            ]
    },
    {
        "name": "Иткулова", 
        "available": [ 
                {"Gr": "5, 6, 7а, 7б, 8а, 8б, 9а, 9б", "Disc": [6,]},
            ]
    },
]


TRAINING_PLAN = [
    
    #0     1     2     3     4     5     6     7
    #5,    6,    7,    8     9     10,   11,   Предмет
    # =========================================================================
    [5,    6,    4,    3,    3,    1,    1,    1],   #  Русский язык 
    [3,    3,    2,    2,    3,    3,    3,    2],   #  Литература 
    [1,    1,    1,    1,    1,    2,    1,    3],   #  Родной язык    
    [1,    1,    1,    1,    1,    0,    0,    4],   #  Родная литература  
    [3,    3,    3,    3,    3,    3,    3,    5],   #  Иностранный язык (английский)  
    [1,    1,    1,    1,    1,    0,    0,    6],   #  Второй иностранный язык (немецкий) 
    [5,    5,    0,    0,    0,    4,    4,    7],   #  Математика 
    [0,    0,    3,    3,    3,    0,    0,    8],   #  Алгебра    
    [0,    0,    2,    2,    2,    0,    0,    9],   #  Геометрия  
    [0,    0,    1,    1,    1,    1,    1,    10],  #  Информатика и ИКТ  
    [2,    2,    2,    2,    2,    2,    2,    11],  #  История России. Всеобщая история   
    [0,    1,    1,    1,    1,    2,    2,    12],  #  Обществознание 
    [1,    1,    1,    1,    1,    1,    1,    13],  #  География  
    [1,    0,    0,    0,    0,    0,    0,    14],  #  ОДНКНР 
    [0,    0,    2,    2,    2,    2,    2,    15],  #  Физика 
    [0,    0,    0,    2,    2,    2,    2,    16],  #  Химия  
    [1,    1,    1,    1,    2,    1,    1,    17],  #  Биология   
    [1,    1,    1,    1,    0,    0,    0,    18],  #  Музыка     
    [1,    1,    1,    0,    0,    0,    0,    19],  #  Изобразительное искусство  
    [1,    1,    1,    1,    0,    0,    0,    20],  #  Технология 
    [0,    0,    0,    1,    1,    1,    1,    21],  #  Основы безопасности жизнедеятельности  
    [2,    2,    2,    2,    2,    2,    2,    22],  #  Физическая культура    
    [0,    0,    0,    0,    0,    0,    1,    23],  #  Астраномия
   
   
]





A = [
    {"id": 0, "title": "A0", "Counts": 30, "dop": []},
    {"id": 1, "title": "A1", "Counts": 30, "dop": []},
    {"id": 2, "title": "A2", "Counts": 300, "dop": ["Sport", ]},
    {"id": 3, "title": "A3", "Counts": 30, "dop": []},
    {"id": 4, "title": "A4", "Counts": 30, "dop": []},
]
G = [
    {"id": 0, "title": "11a", "Students": 20 },
    {"id": 1, "title": "1б", "Students": 20 },
    {"id": 2, "title": "1а", "Students": 20 },
]
D = [
    {"id": 0, "title": "Математика", "Dop": [] },
    {"id": 1, "title": "Физкультура", "Dop": ["Sport", ] },
    {"id": 2, "title": "Русский", "Dop": [] },
    {"id": 3, "title": "Химия", "Dop": [] },
    {"id": 4, "title": "Биология", "Dop": [] },
    {"id": 5, "title": "Английский", "Dop": [] },
    {"id": 6, "title": "Физика", "Dop": [] },
    {"id": 7, "title": "География", "Dop": [] },
    {"id": 8, "title": "Общество", "Dop": [] },
]
T = [
    {
        "id": 0, 
        "name": "Иванов ИИ", 
        "available": [ 
            {"Gr": G[0], "Disc": D[0]},
            {"Gr": G[0], "Disc": D[1]},
            {"Gr": G[0], "Disc": D[2]},
            {"Gr": G[0], "Disc": D[3]},
            {"Gr": G[0], "Disc": D[4]},
        ]
    },
    {
        "id": 1, 
        "name": "петров ПП", 
        "available": [ {"Gr": G[1], "Disc": D[1]} ]
    },
    {
        "id": 2, 
        "name": "Сидоров СС", 
        "available": [ 
            {"Gr": G[2], "Disc": D[2]},
            {"Gr": G[2], "Disc": D[3]},
            {"Gr": G[2], "Disc": D[4]},
        ]
    },
]
UP = [
    {
        "id": 0, 
        "Gr": G[0], 
        "Disc": D[0], 
        "time": 6
    },
    {
        "id": 1, 
        "Gr": G[0], 
        "Disc": D[1], 
        "time": 1
    },
    {
        "id": 1, 
        "Gr": G[0], 
        "Disc": D[2], 
        "time": 3
    },
    {
        "id": 1, 
        "Gr": G[0], 
        "Disc": D[3], 
        "time": 3
    },
    {
        "id": 1, 
        "Gr": G[0], 
        "Disc": D[4], 
        "time": 3
    },
    {
        "id": 2, 
        "Gr": G[1], 
        "Disc": D[1], 
        "time": 15
    },
    {
        "id": 3, 
        "Gr": G[2], 
        "Disc": D[2], 
        "time": 3
    },
    # {
    #     "id": 3, 
    #     "Gr": G[2], 
    #     "Disc": D[3], 
    #     "time": 3
    # },
    # {
    #     "id": 3, 
    #     "Gr": G[2], 
    #     "Disc": D[4], 
    #     "time": 8
    # },
]